ws-asahi/WazamonoCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Kunai (AVR32DU20)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Kunai  (Seeed XIAO form factor, AVR32DU20, USB-C)
 * MCU     : AVR32DU20  (20-pin VQFN, 32 KB flash / 4 KB SRAM)
 * Clock   : internal OSCHF, 24 MHz, NO external crystal.
 *           -> PA0/PA1 are free GPIO (they are the XTALHF pins on crystal
 *              boards, but Kunai is crystal-less, so no clock guards here).
 *           -> USB CLK_USB (48 MHz) = OSCHF + PLL48M, auto-tuned to the USB SOF.
 *
 *  ===== Pin numbering: Seeed XIAO compatible (NONCANONICAL) =====
 *   D#   MCU   XIAO role / notes
 *   D0   PA7   A0  | AC0 OUT | EVOUTA                       AIN27   (no PWM)
 *   D1   PD5   A1                                           AIN5
 *   D2   PA3   A2  | ~PWM(TCA0 WO3) | CCL LUT0-OUT          AIN23   (tone->TCB1)
 *   D3   PA2   A3  | ~PWM(TCA0 WO2) | USART0 XCK | LUT0-IN2 AIN22
 *   D4   PA0   SDA (I2C, TWI0 ALT3) | Serial2 TX | ~PWM(TCA0 WO0) | LUT0-IN0   (no ADC)
 *   D5   PA1   SCL (I2C, TWI0 ALT3) | Serial2 RX | ~PWM(TCA0 WO1) | LUT0-IN1   (no ADC)
 *   D6   PD6   A6  | Serial1 TX (USART1 ALT2)               AIN6
 *   D7   PD7   A7  | Serial1 RX (USART1 ALT2) | EVOUTD      AIN7
 *   D8   PA6   A8  | SCK  (SPI)                             AIN26   (no PWM)
 *   D9   PA5   A9  | MISO (SPI) | ~PWM(TCA0 WO5)            AIN25
 *   D10  PA4   A10 | MOSI (SPI) | ~PWM(TCA0 WO4)            AIN24
 *   D11..D12      (do not exist - gap)
 *   D13  PD4   LED_BUILTIN (on-board, no pad)
 *   --- not on the XIAO pads (appended so the arrays are complete) ---
 *        PC3   VBUS detect (USB power domain)               AIN31   index 14
 *        PF6   RESET                                        index 15
 *        PF7   UPDI                                         index 16  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTA   (WO0..WO5 = PA0..PA5 = D4,D5,D3,D2,D10,D9) : TCA0_PINS below
 *   millis-> TCB0 (boards.txt -DMILLIS_USE_TIMERB0). tone -> TCB1 (DxCore routes
 *           tone to the free TCB; Tone.cpp toggles the pin in software, so tone
 *           works on ANY pin and never disturbs the 6 TCA0 PWM channels. tone and
 *           Servo both want TCB1, so they are mutually exclusive.)
 *   SPI0  -> default (PA4 MOSI / PA5 MISO / PA6 SCK / PA7 SS) = D10/D9/D8/D0.
 *           Board is SPI host; chip-selects are user GPIO (auto-SS not used).
 *   TWI0  -> ALT3 (PA0 SDA / PA1 SCL) = D4/D5. The chip's DEFAULT TWI mux is
 *           PA2/PA3, so PA0/PA1 are the ALT3 (= PINSWAP_3) position. DxCore's Wire
 *           has NO compile-time default-swap, so wazamono_kunai_init.cpp's
 *           initVariant() sets PORTMUX.TWIROUTEA = ALT3 at boot; a plain
 *           Wire.begin() then talks on PA0/PA1. Wire.swap(3) / Wire.pins(PIN_PA0,
 *           PIN_PA1) select the same position.
 *   USART1-> Serial1, ALT2 (PD6 TX / PD7 RX) = D6/D7. (Only usable USART1 position.)
 *   USART0-> Serial2, DEFAULT (PA0 TX / PA1 RX / PA2 XCK / PA3 XDIR) = D4/D5/D3/D2.
 *           <-- shares PA0/PA1 with the I2C pins, so Serial2 and Wire are mutually
 *               exclusive (use one or the other).
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: in DxCore USART0 is "Serial0" and USART1 is "Serial1". The
 *   on-board hardware UART on the XIAO TX/RX pads (D6/D7) is USART1 = Serial1.
 *   The second UART on D4/D5 (USART0) is exposed to users as Serial2 (ascending
 *   board convention); Serial0 remains as its internal alias.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Informational pinout tags. DU_20PIN_PINOUT records the package; these tags are
 * not gated by the core (no #error path), they just identify the board. The real
 * (port,bit) mapping comes from the tables below, selected by
 * NONCANONICAL_PIN_NUMBERS (our numbering does not follow port order). */
#define DU_20PIN_PINOUT
#define WAZAMONO_KUNAI_PINOUT
#define WAZAMONO_BOARD_KUNAI 1  /* Board identification macro (matches bootloader convention) */
#define NONCANONICAL_PIN_NUMBERS

         /*##  ### #   #  ###
          #   #  #  ##  # #
          ####   #  # # #  ###
          #      #  #  ##     #
          #     ### #   #  # */
/* Digital pin number for each MCU pin (Seeed XIAO layout). */
#define PIN_PA7 (0)   // D0  A0 / AC0 OUT / EVOUTA
#define PIN_PD5 (1)   // D1  A1
#define PIN_PA3 (2)   // D2  A2 / TCA0 WO3 / LUT0-OUT
#define PIN_PA2 (3)   // D3  A3 / TCA0 WO2 / USART0 XCK
#define PIN_PA0 (4)   // D4  SDA (TWI0 ALT3) / USART0 TX / TCA0 WO0
#define PIN_PA1 (5)   // D5  SCL (TWI0 ALT3) / USART0 RX / TCA0 WO1
#define PIN_PD6 (6)   // D6  A6 / Serial1 TX (USART1 ALT2)
#define PIN_PD7 (7)   // D7  A7 / Serial1 RX (USART1 ALT2) / EVOUTD
#define PIN_PA6 (8)   // D8  A8 / SPI SCK
#define PIN_PA5 (9)   // D9  A9 / SPI MISO / TCA0 WO5
#define PIN_PA4 (10)  // D10 A10 / SPI MOSI / TCA0 WO4
//  no  D11..D12               (gap)
#define PIN_PD4 (13)  // D13 LED_BUILTIN (on-board only)
#define PIN_PC3 (14)  // VBUS detect (not on a pad)
#define PIN_PF6 (15)  // RESET
#define PIN_PF7 (16)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 17)

         /*##   ##   ###  ###  ###  ###
          #   # #  # #      #  #    #
          ####  ####  ###   #  #     ###
          #   # #  #     #  #  #        #
          ####  #  # ####  ###  ###  # */
#define PINS_COUNT                     (17)  // length of the pin tables (incl. gaps/reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 17
// NUM_INTERNALLY_USED_PINS           -> auto = 0 (no crystal; PA0/PA1 are GPIO)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD4)   // D13, on-board LED
#endif

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

         /*   #  ###   ### ####   ###   ###
          ## ## #   # #    #   # #   # #
          # # # ##### #    ####  #   #  ###
          #   # #   # #    # #   #   #     #
          #   # #   #  ### #  #   ###   ## */
/* Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used). */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

