ws-asahi/WazamonoCore/megaavr/variants/WazamonoKunai/pins_arduino.h
#define analogInputToDigitalPin(p)        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p) <= NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port) == PC ? PIN_PC3 : ((port) == PD ? PIN_PD4 : ((port) == PF ? PIN_PF6 : NOT_A_PIN))))

/* PWM ---------------------------------------------------------------------- */
/* All 6 PWM channels are TCA0 (routed to PORTA below). tone() uses TCB1 in
 * software (any pin), so no pin uses a TCB hardware output -> no TCB PWM here. */
#define digitalPinHasPWMTCB(p)          (0)

/* TCA0 is routed to PORTA, so WO0..WO5 land on PA0..PA5. In XIAO numbering those
 * pins are D4,D5,D3,D2,D10,D9 (NOT contiguous), so the PWM test is an explicit
 * OR-list rather than a range. */
#define TCA0_PINS                       (PORTMUX_TCA0_PORTA_gc)
#define TCB0_PINS                       (0x00)   // TCB0 = millis (no user WO pin)
#define TCB1_PINS                       (0x00)   // TCB1 = tone   (software, any pin)

#define PIN_TCA0_WO0_INIT               (PIN_PA0)
#define PIN_TCB0_WO_INIT                (PIN_PA2)
#define PIN_TCB1_WO_INIT                (PIN_PA3)

#define digitalPinHasPWM(p)             ( (p) == PIN_PA0 || (p) == PIN_PA1 || (p) == PIN_PA2 || \
                                          (p) == PIN_PA3 || (p) == PIN_PA4 || (p) == PIN_PA5 )

         /*##   ###  ####  ##### #   # #   # #   #
          #   # #   # #   #   #   ## ## #   #  # #
          ####  #   # ####    #   # # # #   #   #
          #     #   # #  #    #   #   # #   #  # #
          #      ###  #   #   #   #   #  ###  #   */
#define SPI_INTERFACES_COUNT            (1)

// SPI 0  (host; chip-selects are user GPIO)
#define SPI_MUX                         (PORTMUX_SPI0_DEFAULT_gc)
#define SPI_MUX_PINSWAP_NONE            (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI_MOSI                    (PIN_PA4)   // D10
#define PIN_SPI_MISO                    (PIN_PA5)   // D9
#define PIN_SPI_SCK                     (PIN_PA6)   // D8
#define PIN_SPI_SS                      (PIN_PA7)   // D0 (hardware SS; shared with AC0 OUT)

// TWI 0  (I2C on D4/D5 = PA0/PA1 = TWI0 ALT3; see header + wazamono_kunai_init.cpp)
//   PIN_WIRE_SDA/SCL must name the chip's DEFAULT-mux pins (PA2/PA3) because the
//   core equates "PIN_WIRE_SDA" with PORTMUX_TWI0_DEFAULT_gc. PA0/PA1 are exposed
//   as PINSWAP_3 (ALT3) and made the power-on default in initVariant().
#define PIN_WIRE_SDA                    (PIN_PA2)   // TWI0 DEFAULT-mux home (D3); not the I2C pad
#define PIN_WIRE_SCL                    (PIN_PA3)   // TWI0 DEFAULT-mux home (D2); not the I2C pad
#define PIN_WIRE_SDA_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SDA_PINSWAP_3          (PIN_PA0)   // ALT3 = PA0 = D4 (Kunai I2C SDA, power-on default)
#define PIN_WIRE_SCL_PINSWAP_3          (PIN_PA1)   // ALT3 = PA1 = D5 (Kunai I2C SCL, power-on default)

// USART0 -> "Serial0", user-facing "Serial2". DEFAULT position (PA0/PA1 = D4/D5).
#define HWSERIAL0_MUX                   (0x00 /* PORTMUX_USART0_DEFAULT_gc */)
#define HWSERIAL0_MUX_PINSWAP_1         (0x01 /* PORTMUX_USART0_ALT1_gc - PA4..PA7 */)
#define HWSERIAL0_MUX_PINSWAP_2         (0x02 /* PORTMUX_USART0_ALT2_gc - PA2/PA3 */)
#define HWSERIAL0_MUX_PINSWAP_3         (0x03 /* PORTMUX_USART0_ALT3_gc - PD4..PD7 */)
#define HWSERIAL0_MUX_PINSWAP_NONE      (0x05)
#define HWSERIAL0_MUX_DEFAULT          (0)   /* Kunai default: USART0 DEFAULT (PA0/PA1 = D4/D5). */
#define PIN_HWSERIAL0_TX                (PIN_PA0)   // D4
#define PIN_HWSERIAL0_RX                (PIN_PA1)   // D5
#define PIN_HWSERIAL0_XCK               (PIN_PA2)   // D3
#define PIN_HWSERIAL0_XDIR              (PIN_PA3)   // D2
#define PIN_HWSERIAL0_TX_PINSWAP_1      (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1      (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1     (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    (PIN_PA7)
#define PIN_HWSERIAL0_TX_PINSWAP_2      (PIN_PA2)
#define PIN_HWSERIAL0_RX_PINSWAP_2      (PIN_PA3)
#define PIN_HWSERIAL0_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_2    (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_3      (PIN_PD4)
#define PIN_HWSERIAL0_RX_PINSWAP_3      (PIN_PD5)
#define PIN_HWSERIAL0_XCK_PINSWAP_3     (PIN_PD6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_3    (PIN_PD7)

// USART1 -> "Serial1", only usable position is ALT2 (PD6/PD7 = D6/D7)
#define HWSERIAL1_MUX                   (0x00 /* PORTMUX_USART1_DEFAULT_gc - no pins */)
#define HWSERIAL1_MUX_PINSWAP_1         (0x01 << 3 /* ALT1 absent on DU - placeholder so the PINSWAP_2 row is built */)
#define HWSERIAL1_MUX_PINSWAP_2         (0x02 << 3 /* PORTMUX_USART1_ALT2_gc */)
#define HWSERIAL1_MUX_PINSWAP_NONE      (0x03 << 3)
#define PIN_HWSERIAL1_TX                (NOT_A_PIN)
#define PIN_HWSERIAL1_RX                (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK               (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR              (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_RX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK_PINSWAP_1     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_2      (PIN_PD6)   // D6
#define PIN_HWSERIAL1_RX_PINSWAP_2      (PIN_PD7)   // D7
#define PIN_HWSERIAL1_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_2    (NOT_A_PIN)
#define HWSERIAL1_MUX_DEFAULT          (2)   /* DU: USART1 ALT2 (PD6/PD7); USART1 has no usable DEFAULT position */

         /*##  #   #  ###  #     ###   ###      ####  ### #   #  ###
          #   # ##  # #   # #    #   # #         #   #  #  ##  # #
          ##### # # # ##### #    #   # #  ##     ####   #  # # #  ###
          #   # #  ## #   # #    #   # #   #     #      #  #  ##     #
          #   # #   # #   # ####  ###   ###      #     ### #   #  # */
/* Arduino analog aliases. XIAO keeps A0..A3 and A6..A10 (one per pad); A4/A5 do
 * not exist because their pads (D4=PA0, D5=PA1) have no ADC input on the DU. */
#define PIN_A0   (PIN_PA7)   // D0
#define PIN_A1   (PIN_PD5)   // D1
#define PIN_A2   (PIN_PA3)   // D2
#define PIN_A3   (PIN_PA2)   // D3
#define PIN_A4   (NOT_A_PIN)
#define PIN_A5   (NOT_A_PIN)
#define PIN_A6   (PIN_PD6)   // D6
#define PIN_A7   (PIN_PD7)   // D7
#define PIN_A8   (PIN_PA6)   // D8
#define PIN_A9   (PIN_PA5)   // D9
#define PIN_A10  (PIN_PA4)   // D10
/* PD4 (D13, LED_BUILTIN) and PC3 (VBUS detect) get no Ax alias: PD4 has no ADC,
 * PC3 is the VBUS-sense pin (still reachable as analogRead(AIN31) if needed). */

/* --- Uno R4 style number-prefixed digital pin aliases (pads + LED only) ---
 * D-number == Arduino digital pin number. Internal-only pins (PC3 VBUS-detect,
 * PF6 RESET, PF7 UPDI) are intentionally NOT exposed as Dn.
 * #undef guards clear any stray macro definitions, matching the Uno R4 pattern. */
#undef D0
#undef D1
#undef D2
#undef D3
#undef D4
#undef D5
#undef D6
#undef D7
#undef D8
#undef D9
#undef D10
#undef D13
static const uint8_t D0  = PIN_PA7;  // A0 / AC0 OUT
static const uint8_t D1  = PIN_PD5;  // A1
static const uint8_t D2  = PIN_PA3;  // A2 / TCA0 WO3
static const uint8_t D3  = PIN_PA2;  // A3 / TCA0 WO2 / USART0 XCK
static const uint8_t D4  = PIN_PA0;  // SDA / Serial2 TX / TCA0 WO0
static const uint8_t D5  = PIN_PA1;  // SCL / Serial2 RX / TCA0 WO1
static const uint8_t D6  = PIN_PD6;  // Serial1 TX
static const uint8_t D7  = PIN_PD7;  // Serial1 RX
static const uint8_t D8  = PIN_PA6;  // SCK
static const uint8_t D9  = PIN_PA5;  // MISO / TCA0 WO5
static const uint8_t D10 = PIN_PA4;  // MOSI / TCA0 WO4
static const uint8_t D13 = PIN_PD4;  // LED_BUILTIN (on-board only, no pad)

#undef A0
#undef A1
#undef A2
#undef A3
#undef A6
#undef A7
#undef A8
#undef A9
#undef A10
static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;

