ws-asahi/WazamonoCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

         /*##  ### #   #      ###  ####  ####   ###  #   #  ###
          #   #  #  ##  #     #   # #   # #   # #   #  # #  #
          ####   #  # # #     ##### ####  ####  #####   #    ###
          #      #  #  ##     #   # #  #  #  #  #   #   #       #
          #     ### #   #     #   # #   # #   # #   #   #    # */
#ifdef ARDUINO_MAIN
  // Indexed by digital pin number (0..16). Gaps and reserved pins are NOT_A_PORT.
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA7  A0 / AC0 OUT
    PD,         //  1 PD5  A1
    PA,         //  2 PA3  A2 / TCA0 WO3
    PA,         //  3 PA2  A3 / TCA0 WO2
    PA,         //  4 PA0  SDA / Serial2 TX / TCA0 WO0
    PA,         //  5 PA1  SCL / Serial2 RX / TCA0 WO1
    PD,         //  6 PD6  Serial1 TX
    PD,         //  7 PD7  Serial1 RX
    PA,         //  8 PA6  SCK
    PA,         //  9 PA5  MISO / TCA0 WO5
    PA,         // 10 PA4  MOSI / TCA0 WO4
    NOT_A_PORT, // 11 (gap)
    NOT_A_PORT, // 12 (gap)
    PD,         // 13 PD4  LED_BUILTIN
    PC,         // 14 PC3  VBUS detect
    PF,         // 15 PF6  RESET
    PF          // 16 PF7  UPDI
  };

  /* Bit position within the port (for PINnCTRL access). */
  const uint8_t digital_pin_to_bit_position[] = {
    PIN7_bp,   //  0 PA7
    PIN5_bp,   //  1 PD5
    PIN3_bp,   //  2 PA3
    PIN2_bp,   //  3 PA2
    PIN0_bp,   //  4 PA0
    PIN1_bp,   //  5 PA1
    PIN6_bp,   //  6 PD6
    PIN7_bp,   //  7 PD7
    PIN6_bp,   //  8 PA6
    PIN5_bp,   //  9 PA5
    PIN4_bp,   // 10 PA4
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    PIN4_bp,   // 13 PD4
    PIN3_bp,   // 14 PC3
    PIN6_bp,   // 15 PF6
    PIN7_bp    // 16 PF7
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN7_bm,   //  0 PA7
    PIN5_bm,   //  1 PD5
    PIN3_bm,   //  2 PA3
    PIN2_bm,   //  3 PA2
    PIN0_bm,   //  4 PA0
    PIN1_bm,   //  5 PA1
    PIN6_bm,   //  6 PD6
    PIN7_bm,   //  7 PD7
    PIN6_bm,   //  8 PA6
    PIN5_bm,   //  9 PA5
    PIN4_bm,   // 10 PA4
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    PIN4_bm,   // 13 PD4
    PIN3_bm,   // 14 PC3
    PIN6_bm,   // 15 PF6
    PIN7_bm    // 16 PF7
  };

  /* All PWM is TCA0, resolved dynamically from PORTMUX, so every TCA0 pin is
   * NOT_ON_TIMER here (analogWrite resolves them via TCA0_PINS). millis uses TCB0
   * and tone uses TCB1 in software, neither of which is a user PWM output, so no
   * pin is mapped to a TCB. */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA7
    NOT_ON_TIMER, //  1 PD5
    NOT_ON_TIMER, //  2 PA3  (TCA0 WO3, dynamic)
    NOT_ON_TIMER, //  3 PA2  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, //  4 PA0  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  5 PA1  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  6 PD6
    NOT_ON_TIMER, //  7 PD7
    NOT_ON_TIMER, //  8 PA6
    NOT_ON_TIMER, //  9 PA5  (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 10 PA4  (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 11 (gap)
    NOT_ON_TIMER, // 12 (gap)
    NOT_ON_TIMER, // 13 PD4
    NOT_ON_TIMER, // 14 PC3
    NOT_ON_TIMER, // 15 PF6
    NOT_ON_TIMER  // 16 PF7
  };
#endif

/* =================================================================
 *  USB identity   (AVR DU = USB-native part, treated like the 32U4)
 * =================================================================
 *  USBCON enables Arduino's HID / Keyboard / Mouse / etc. on this board.
 *  NOTE: the native USB-CDC descriptor's VID/PID/product string are taken
 *  from cores/dxcore/usb_descriptors.{h,c} (which does NOT include this
 *  file), so the values below are informational only - keep them in sync.
 *  Effective app identity: 0x1209:0x000A, product "Wazamono Kunai".
 *  Obtain a real product VID/PID before release (pid.codes = dev only).
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0x000A
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "Workshop Asahi"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "Wazamono Kunai"
#endif

/* =================================================================
 *  Serial -> native USB CDC   (Leonardo/Micro convention)
 * =================================================================
 *  Serial  = USBSerial (on-chip USB CDC)              <- primary / USB serial monitor
 *  Serial1 = USART1   (D6/D7, ALT2 - the on-board hardware UART pads)
 *  Serial2 = USART0   (D4/D5, DEFAULT - extra UART; shares pins with Wire/I2C,
 *                      so Serial2 and Wire are mutually exclusive)
 *  Serial0 is the DxCore-internal name for USART0; the user-facing name is Serial2.
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (from boards.txt) to keep Serial==USART0.
 */

/* Expose USART0 as Serial2 (ascending board convention). The core's Serial0
 * object is kept intact for upstream mergeability; this is only a user-facing
 * alias. Serial2 (USART2) does not exist on the AVR DU, so the name is free. */
#ifndef Serial2
  #define Serial2 Serial0
#endif

#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* on-board hardware UART on D6/D7 */
  #endif
  #ifndef SERIAL_PORT_HARDWARE_OPEN
    #define SERIAL_PORT_HARDWARE_OPEN  Serial2  /* extra UART on D4/D5 (USART0) */
  #endif
#endif

#endif /* Pins_Arduino_h */
